Revit 2027 API
FamilyManager.RenameParameter Method
Rename a family parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RenameParameter(
	FamilyParameter familyParameter,
	string name
)
Public Sub RenameParameter (
	familyParameter As FamilyParameter,
	name As String
)
public:
void RenameParameter(
	FamilyParameter^ familyParameter,
	String^ name
)
member RenameParameter :
        familyParameter : FamilyParameter *
        name : string -> unit
Parameters
familyParameter FamilyParameter
The family parameter.
name String
The new name.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"familyParameter" or "name"-is null.
ArgumentException |  Thrown when the input argument-"familyParameter"-is invalid, or the input name string contains illegal characters, or duplicated with existing parameter name.
InvalidOperationException |  Thrown when trying to rename a built-in parameter or shared parameter.
Remarks
This operation is valid only for Family Parameters, and is invalid for Shared Parameters and Built-in Parameters.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace